Revit 2020 API
TableSectionData.GetCellUnitType Method
 Gets the unit type of a cell, if applicable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2014
Syntax
C#
public UnitType GetCellUnitType(
	int nRow,
	int nCol
)
Visual Basic
Public Function GetCellUnitType ( _
	nRow As Integer, _
	nCol As Integer _
) As UnitType
Visual C++
public:
UnitType GetCellUnitType(
	int nRow,
	int nCol
)
Parameters
nRow
Type: System.Int32
 The row index of the cell
nCol
Type: System.Int32
 The column index of the cell
Return Value
 The unit type, or UT_Undefined if the cell does not contain a number with units.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given row number nRow is invalid. -or- The given column number nCol is invalid.
See Also
TableSectionData Class
Autodesk.Revit.DB Namespace